Revit 2024 API
StructuralSectionHotRolled.FlangeThickness Property
 Flange Thickness.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double FlangeThickness { get; set; }
Visual Basic
Public Property FlangeThickness As Double
	Get
	Set
Visual C++
public:
property double FlangeThickness {
	double get ();
	void set (double value);
}
See Also
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace